tutorials/heatTransfer/buoyantSimpleRadiationFoam/hotRadiationRoom/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           CG;
        preconditioner   Cholesky;
        tolerance        1e-06;
        relTol           0.01;
    }
    U
    {
        solver           BiCGStab;
        preconditioner   ILU0;
        tolerance        1e-05;
        relTol           0.1;
    }
    h
    {
        solver           BiCGStab;
        preconditioner   ILU0;
        tolerance        1e-05;
        relTol           0.1;
    }
    k
    {
        solver           BiCGStab;
        preconditioner   ILU0;
        tolerance        1e-05;
        relTol           0.1;
    }
    epsilon
    {
        solver           BiCGStab;
        preconditioner   ILU0;
        tolerance        1e-05;
        relTol           0.1;
    }
    G
    {
        solver           CG;
        preconditioner   Cholesky;
        tolerance        1e-05;
        relTol           0.1;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    pRefCell         0;
    pRefValue        0;
}

relaxationFactors
{
    rho             1.0;
    p               0.3;
    U               0.7;
    h               0.7;
    k               0.7;
    epsilon         0.7;
    G               0.7;
}

// ************************************************************************* //
